jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32A4xx_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
    <vendor>Geehy</vendor>
    <name>APM32A4xx_DFP</name>
    <description>Geehy Semiconductor APM32A4 Series Device Support, Drivers and Examples</description>
    <url>https://www.geehy.com/uploads/tool/</url>
    <supportContact>https://www.geehy.com/support/apm</supportContact>
    <releases>
        <release version="1.0.0" date="2023-01-11">
      First Release version of APM32A4 Device Family Pack.
        </release>
    </releases>
    <keywords>
        <!-- keywords for indexing -->
        <keyword>Geehy</keyword>
        <keyword>Device Support</keyword>
        <keyword>Device Family Package Geehy Semiconductor</keyword>
        <keyword>APM32A4</keyword>
        <keyword>APM32</keyword>
    </keywords>
    <devices>
        <family Dfamily="APM32A4 Series" Dvendor="Geehy:163">
            <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
            <book name="Documents/dui0553a_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
            <description>
The APM32A4 family incorporates high-speed embedded memories and an extensive range of enhanced I/Os and peripherals connected to two APB buses, three AHB buses and a 32-bit multi-AHB bus matrix.
- 64-Kbyte of CCM (core coupled memory) data RAM
- FPU floating-point processing unit
- Timer with quadrature (incremental) encoder input
- Parallel camera interface
- True random number generator
- RTC: subsecond accuracy, hardware calendar
- 96-bit unique ID</description>
            <feature type="WDT" n="2"/>
            <feature type="RTC" n="32768"/>
            <feature type="CAN" n="2"/>
            <feature type="USBD" n="2"/>
            <feature type="VCC" n="2.00" m="3.60"/>
            <feature type="Temp" n="-40" m="85"/>
            <feature type="Temp" n="-40" m="105"/>
           
            <!-- ************************  Subfamily 'APM32A407'  **************************** -->
            <subFamily DsubFamily="APM32A407">
                <processor Dclock="168000000"/>
                <debug svd="SVD/APM32A40x.svd"/>
                <book name="Documents/DATASHEET.pdf" title="APM32A4"/>
                <feature type="Timer" n="12" m="16"/>
                <feature type="DAC" n="2" m="12"/>
                <feature type="SPI" n="3" m="37500000"/>
                <feature type="USART" n="4" m="10500000"/>
                <feature type="UART" n="2" m="10500000"/>
                <feature type="USBOTG" n="3"/>
                <feature type="CAN" n="2"/>
                <feature type="SDIO" n="1" m="8" name="Secure Digital IO"/>
                <feature type="ETH" n="1" m="100000000"/>
                <feature type="VCC" n="1.80" m="3.60"/>
                <feature type="Camera" n="1" m="14"/>
                <!-- *************************  Device 'APM32A407VG'  ***************************** -->
                <device Dname="APM32A407VG">
                    <memory id="IROM1" start="0x08000000" size="0x00100000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <memory id="IRAM2" start="0x10000000" size="0x00010000" init="0" default="0"/>
                    <algorithm name="Flash/APM32A4xx_1024.FLM" start="0x08000000" size="0x00100000" default="1"/>
                    <algorithm name="Flash/APM32A40xxx_OPT.FLM" start="0x1FFFC000" size="0x00000004" default="0"/>
                    <algorithm name="Flash/APM32A4xx_OTP.FLM" start="0x1FFF7800" size="0x00000210" default="0"/>
                    <feature type="IOs" n="82"/>
                    <feature type="ADC" n="16" m="12"/>
                </device>
                <!-- *************************  Device 'APM32A407ZG'  ***************************** -->
                <device Dname="APM32A407ZG">
                    <memory id="IROM1" start="0x08000000" size="0x00100000" startup="1" default="1"/>
                    <memory id="IRAM1" start="0x20000000" size="0x00020000" init="0" default="1"/>
                    <memory id="IRAM2" start="0x10000000" size="0x00010000" init="0" default="0"/>
                    <algorithm name="Flash/APM32A4xx_1024.FLM" start="0x08000000" size="0x00100000" default="1"/>
                    <algorithm name="Flash/APM32A40xxx_OPT.FLM" start="0x1FFFC000" size="0x00000004" default="0"/>
                    <algorithm name="Flash/APM32A4xx_OTP.FLM" start="0x1FFF7800" size="0x00000210" default="0"/>
                    <feature type="IOs" n="114"/>
                    <feature type="ADC" n="24" m="12"/>
                </device>
            </subFamily> 
        </family>
    </devices>
    <conditions>
        <!-- conditions selecting Compiler -->
        <condition id="Compiler ARMCC">
            <require Tcompiler="ARMCC"/>
        </condition>
        <condition id="APM32A4xx">
            <description>Geehy Semiconductor APM32A4xx Device</description>
            <require Dvendor="Geehy:163" Dname="APM32A4*"/>
        </condition>
        <condition id="APM32A40x">
            <description>Geehy Semiconductor APM32A40xxx Series devices</description>
            <require Dvendor="Geehy:163" Dname="APM32A40*"/>
        </condition>
        <condition id="APM32A407xx">
            <description>Geehy Semiconductor APM32A407xx Series devices</description>
            <require Dvendor="Geehy:163" Dname="APM32A407*"/>
        </condition>
        <condition id="APM32A4xx CMSIS">
            <description>Geehy Semiconductor APM32A4xx Device with CMSIS</description>
            <require condition="APM32A4xx"/>
            <require Cclass="CMSIS" Cgroup="CORE"/>
        </condition>
        <condition id="APM32A40x ARMCC">
            <description>filter for APM32A40x Device and the ARM compiler</description>
            <require condition="APM32A40x"/>
            <require Tcompiler="ARMCC"/>
        </condition>
