jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32A4xx_DFP.pdsc
        <condition id="APM32A4xx STDPERIPH">
            <description>Geehy Semiconductor APM32A4xx with Standard Peripherals Drivers Framework</description>
            <require condition="APM32A4xx CMSIS"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
        </condition>
        <condition id="APM32A4xx STDPERIPH RCM">
            <description>Geehy Semiconductor APM32A4xx with Standard Peripherals Drivers Framework and RCM</description>
            <require condition="APM32A4xx CMSIS"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework"/>
            <require Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCM"/>
        </condition>
    </conditions>
    <components>
        <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="APM32A4xx CMSIS">
            <description>System Startup for Geehy Semiconductor APM32A4xx device series</description>
            <files>
                <!--  include folder -->
                <file category="include" name="Device/CMSIS/Include/"/>
                <file category="include" name="Device/Device/Geehy/APM32A4xx/Include/"/>
                <!-- startup files -->
                <file category="source" name="Device/Device/Geehy/APM32A4xx/Source/arm/startup_apm32a40x.s" attr="config" version="1.0.0" condition="APM32A40x ARMCC"/>
                <!-- system file -->
                <file category="source" name="Device/Device/Geehy/APM32A4xx/Source/system_apm32a4xx.c" attr="config" version="1.0.0"/>
                <!-- device configuration required by drivers at the moment -->
            </files>
        </component>
        <!-- START: Geehy Semiconductor Standard Peripherals Drivers -->
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="Framework" Cversion="1.0.0" condition="APM32A4xx STDPERIPH">
            <description>Standard Peripherals Drivers Framework</description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FRAMEWORK</RTE_Components_h>
            <files>
                <file category="include" name="Device/APM32A4xx_StdPeriphDriver/inc/"/>
                <file category="header" name="Device/APM32A4xx_StdPeriphDriver/inc/apm32a4xx_misc.h"/>
                <file category="source" name="Device/APM32A4xx_StdPeriphDriver/src/apm32a4xx_misc.c"/>
                <file category="header" name="Device/Templates/apm32a4xx_int.h" attr="template" select="Interrupt Service Routines"/>
                <file category="source" name="Device/Templates/apm32a4xx_int.c" attr="template" select="Interrupt Service Routines"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="ADC" Cversion="1.0.0" condition="APM32A4xx STDPERIPH RCM">
            <description>Analog-to-digital converter (ADC) driver for APM32A4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_ADC </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32A4xx_StdPeriphDriver/inc/apm32a4xx_adc.h"/>
                <file category="source" name="Device/APM32A4xx_StdPeriphDriver/src/apm32a4xx_adc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CAN" Cversion="1.0.0" condition="APM32A4xx STDPERIPH RCM">
            <description>Controller area network (CAN) driver for APM32A4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CAN      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32A4xx_StdPeriphDriver/inc/apm32a4xx_can.h"/>
                <file category="source" name="Device/APM32A4xx_StdPeriphDriver/src/apm32a4xx_can.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRC" Cversion="1.0.0" condition="APM32A4xx STDPERIPH">
            <description>CRC calculation unit (CRC) driver for APM32A4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CRC      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32A4xx_StdPeriphDriver/inc/apm32a4xx_crc.h"/>
                <file category="source" name="Device/APM32A4xx_StdPeriphDriver/src/apm32a4xx_crc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="CRYP" Cversion="1.0.0" condition="APM32A4xx STDPERIPH">
            <description>Cryptographic processor (CRYP) driver for APM32A4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_CRYP      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32A4xx_StdPeriphDriver/inc/apm32a4xx_cryp.h"/>
                <file category="source" name="Device/APM32A4xx_StdPeriphDriver/src/apm32a4xx_cryp.c"/>
                <file category="source" name="Device/APM32A4xx_StdPeriphDriver/src/apm32a4xx_cryp_aes.c"/>
                <file category="source" name="Device/APM32A4xx_StdPeriphDriver/src/apm32a4xx_cryp_des.c"/>
                <file category="source" name="Device/APM32A4xx_StdPeriphDriver/src/apm32a4xx_cryp_tdes.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DAC" Cversion="1.0.0" condition="APM32A4xx STDPERIPH RCM">
            <description>Digital-to-analog converter (DAC) driver for APM32A4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DAC     </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32A4xx_StdPeriphDriver/inc/apm32a4xx_dac.h"/>
                <file category="source" name="Device/APM32A4xx_StdPeriphDriver/src/apm32a4xx_dac.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DBGMCU" Cversion="1.0.0" condition="APM32A4xx STDPERIPH">
            <description>MCU debug component (DBGMCU) driver for APM32A4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DBGMCU</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32A4xx_StdPeriphDriver/inc/apm32a4xx_dbgmcu.h"/>
                <file category="source" name="Device/APM32A4xx_StdPeriphDriver/src/apm32a4xx_dbgmcu.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DCI" Cversion="1.0.0" condition="APM32A4xx STDPERIPH RCM">
            <description>Digital camera interface (DCI) driver for APM32A4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DCI      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32A4xx_StdPeriphDriver/inc/apm32a4xx_dci.h"/>
                <file category="source" name="Device/APM32A4xx_StdPeriphDriver/src/apm32a4xx_dci.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMA" Cversion="1.0.0" condition="APM32A4xx STDPERIPH RCM">
            <description>DMA controller (DMA) driver for APM32A4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_DMA      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32A4xx_StdPeriphDriver/inc/apm32a4xx_dma.h"/>
                <file category="source" name="Device/APM32A4xx_StdPeriphDriver/src/apm32a4xx_dma.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="DMC" Cversion="1.0.0" condition="APM32A4xx STDPERIPH">
            <description>SDRC driver for APM32A4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_SDRC</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32A4xx_StdPeriphDriver/inc/apm32a4xx_dmc.h"/>
                <file category="source" name="Device/APM32A4xx_StdPeriphDriver/src/apm32a4xx_dmc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="EINT" Cversion="1.0.0" condition="APM32A4xx STDPERIPH">
            <description>External interrupt/event controller (EINT) driver for APM32A4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_EINT </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32A4xx_StdPeriphDriver/inc/apm32a4xx_eint.h"/>
                <file category="source" name="Device/APM32A4xx_StdPeriphDriver/src/apm32a4xx_eint.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="FMC" Cversion="1.0.0" condition="APM32A4xx STDPERIPH">
            <description>Flash memory controller driver for APM32A4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_FMC     </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32A4xx_StdPeriphDriver/inc/apm32a4xx_fmc.h"/>
                <file category="source" name="Device/APM32A4xx_StdPeriphDriver/src/apm32a4xx_fmc.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="GPIO" Cversion="1.0.0" condition="APM32A4xx STDPERIPH RCM">
            <description>General-purpose I/O (GPIO) driver for APM32A4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_GPIO      </RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32A4xx_StdPeriphDriver/inc/apm32a4xx_gpio.h"/>
                <file category="source" name="Device/APM32A4xx_StdPeriphDriver/src/apm32a4xx_gpio.c"/>
            </files>
        </component>
