jhlee741/ece342lab0/blinky-2/blinky/Drivers/CMSIS/.Web/Geehy.APM32A4xx_DFP.pdsc
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USART" Cversion="1.0.0" condition="APM32A4xx STDPERIPH RCM">
            <description>Universal synchronous asynchronous receiver transmitter (USART) driver for APM32A4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_USART</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32A4xx_StdPeriphDriver/inc/apm32a4xx_usart.h"/>
                <file category="source" name="Device/APM32A4xx_StdPeriphDriver/src/apm32a4xx_usart.c"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="WWDT" Cversion="1.0.0" condition="APM32A4xx STDPERIPH RCM">
            <description>Window watchdog (WWDT) driver for APM32A4xx </description>
            <RTE_Components_h>#define RTE_DEVICE_STDPERIPH_WWDT</RTE_Components_h>
            <files>
                <file category="header" name="Device/APM32A4xx_StdPeriphDriver/inc/apm32a4xx_wwdt.h"/>
                <file category="source" name="Device/APM32A4xx_StdPeriphDriver/src/apm32a4xx_wwdt.c"/>
            </files>
        </component>
        <!-- END: Geehy Semiconductor Standard Peripherals Drivers -->
    </components>
    <boards>
        <board vendor="Geehy" name="APM32A407MINI" revision="Ver 1.0">
            <description>Geehy APM32A407 Development Board</description>
            
            <mountedDevice deviceIndex="0" Dvendor="Geehy:163" Dname="APM32A407VG"/>
            <compatibleDevice deviceIndex="0" Dvendor="Geehy:163" DsubFamily="APM32A407"/>
            <feature type="XTAL" n="8000000"/>
            <feature type="PWR" n="5" name="USB Powered"/>
            <feature type="USB" n="1" name="USB 2.0 Full Speed Device"/>
            <feature type="RS232" n="1"/>
            <feature type="Button" n="2" name="Reset, KEY1 and KEY2"/>
            <feature type="LED" n="2" name="LEDs directly connected to port pins"/>
            <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
        </board>
    </boards>
    <examples>
        <example name="APM32A407MINI-Blinky" doc="readme.txt" folder="Boards/Geehy/APM32A407MINI/Blinky">
            <description>APM32A407_MINI  Blinky example</description>
            <board name="APM32A407MINI" vendor="Geehy"/>
            <project>
                <environment name="uv" load="APM32A407MINI-Blinky.uvprojx"/>
            </project>
            <attributes>
                <component Cclass="CMSIS" Cgroup="CORE"/>
                <component Cclass="Device" Cgroup="Startup"/>
                <category>Getting Started</category>
                <keyword>LED</keyword>
                <keyword>APM32A407</keyword>
            </attributes>
        </example>
    </examples>
</package>